Documents/СоставлениеРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>СоставлениеРасписания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасписаниеНаДату</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НагрузкаГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖурналЗаполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Занятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкаУрока</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дисциплина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кабинет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Преподаватель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СоставлениеРасписания/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Семестр) Тогда
		Элементы.Семестр.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчебныйПланПриИзменении(Элемент)
	ОтборПоГоду = УстановитьОтборСеместра();
	
	мПараметр = Новый Массив();
	Параметр = Новый ПараметрВыбора("Отбор.Владелец", ОтборПоГоду);
	мПараметр.Добавить(Параметр);
	
	Элементы.Семестр.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметр);
	
	Элементы.Семестр.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаСервере
Функция УстановитьОтборСеместра()
	Результат = Объект.УчебныйПлан.УчебныйГод;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДатаРасписанияПриИзменении(Элемент)
	ПроверкаДаты();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДаты()
	ТекущаяДата = Объект.ДатаРасписания;
	ДатаНачала = Объект.Семестр.ДатаНачала;
	ДатаОкончания = Объект.Семестр.ДатаОкончания;
	
	Если ТекущаяДата <= ДатаНачала ИЛИ ТекущаяДата >= ДатаОкончания Тогда
		Сообщить("Нельзя выставить дату, не входящую в состав выбранного семестра!");
		Объект.ДатаРасписания = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеДисциплинаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДляФормы = Новый Структура("Группа, Семестр", Объект.Группа, Объект.Семестр);
	Форма = ПолучитьФорму("Справочник.Дисциплины.Форма.ФормаВыбораВРасписании", ПараметрыДляФормы, Элементы.РасписаниеДисциплина);
	Форма.Открыть();
КонецПроцедуры
